; domain
(define (domain wolf-goat-cabbage)
  (:requirements :typing )
  (:types
   place - object
   boat side - place
   passenger - object
   thing - passenger
   wolf goat cabbage - thing
   person - passenger
   )

  (:predicates
   (passenger-at ?passenger ?place)
   (boat-at ?boat ?side)
   (other-side ?side ?side)
   )

  ;; does not support simultaneous actions
  ;; no negations

  (:action enter-boat
           :parameters (?p - person ?w - wolf ?g - goat ?c - cabbage ?b - boat
                           ?ps - side ?ws - side ?cs - side ?gs - side)
           :precondition (and (passenger-at ?p ?ps) (boat-at ?b ?ps) (other-side ?gs ?cs)
                              (other-side ?ws ?gs)
                              (passenger-at ?w ?ws) (passenger-at ?g ?gs) (passenger-at ?c ?cs)
                              )
           :effect (and (passenger-at ?p ?b) (not (passenger-at ?p ?ps))))

  (:action leave-empty-boat
           :parameters (?p - person ?w - wolf ?g - goat ?c - cabbage ?b - boat
                           ?ps - side ?ws - side ?cs - side ?gs - side)
           :precondition (and (passenger-at ?p ?b) (boat-at ?b ?ps) (other-side ?gs ?cs)
                              (other-side ?ws ?gs)
                              (passenger-at ?w ?ws) (passenger-at ?g ?gs) (passenger-at ?c ?cs)
                              )
           :effect (and (passenger-at ?p ?ps) (not (passenger-at ?p ?b))))

  (:action enter-boat-with-wolf
           :parameters (?p - person ?w - wolf ?g - goat ?c - cabbage ?b - boat
                           ?ws - side ?cs - side ?gs - side)
           :precondition (and (passenger-at ?p ?ws) (boat-at ?b ?ws) (other-side ?gs ?cs)
                              (passenger-at ?w ?ws) (passenger-at ?g ?gs) (passenger-at ?c ?cs)
                              )
           :effect (and (passenger-at ?p ?b) (not (passenger-at ?p ?ws))
                        (passenger-at ?w ?b) (not (passenger-at ?w ?ws)) ))

  (:action enter-boat-with-cabbage
           :parameters (?p - person ?w - wolf ?g - goat ?c - cabbage ?b - boat
                           ?ws - side ?cs - side ?gs - side)
           :precondition (and (passenger-at ?p ?cs) (boat-at ?b ?cs) (other-side ?gs ?ws)
                              (passenger-at ?w ?ws) (passenger-at ?g ?gs) (passenger-at ?c ?cs)
                              )
           :effect (and (passenger-at ?p ?b) (not (passenger-at ?p ?cs))
                        (passenger-at ?c ?b) (not (passenger-at ?c ?cs)) ))

  (:action enter-boat-with-goat
           :parameters (?p - person ?w - wolf ?g - goat ?c - cabbage ?b - boat
                           ?ws - side ?cs - side ?gs - side)
           :precondition (and (passenger-at ?p ?gs) (boat-at ?b ?gs)
                              (passenger-at ?w ?ws) (passenger-at ?g ?gs) (passenger-at ?c ?cs)
                              )
           :effect (and (passenger-at ?p ?b) (not (passenger-at ?p ?gs))
                        (passenger-at ?g ?b) (not (passenger-at ?g ?gs)) ))

  (:action leave-boat-with-thing
           :parameters (?p - person ?t - thing ?b - boat ?s - side)
           :precondition (and (passenger-at ?p ?b) (passenger-at ?t ?b) (boat-at ?b ?s) )
           :effect (and (passenger-at ?p ?s) (not (passenger-at ?p ?b))
                        (passenger-at ?t ?s) (not (passenger-at ?t ?b)) ))

  (:action row-boat
           :parameters (?p - person ?b - boat ?from - side ?to - side)
           :precondition (and (passenger-at ?p ?b) (boat-at ?b ?from) (other-side ?from ?to))
           :effect (and (boat-at ?b ?to) (not (boat-at ?b ?from)) ))
  )

; problem
(define (problem wolf-goat-cabbage-classic)
  (:domain wolf-goat-cabbage)

  (:objects
   w - wolf
   g - goat
   c - cabbage
   farmer - person
   start - side
   end - side
   b - boat
   )

  (:init
   (passenger-at w start)
   (passenger-at g start)
   (passenger-at c start)
   (passenger-at farmer start)

   (boat-at b start)
   (other-side start end)
   (other-side end start)
   )

  (:goal
   (and
    (passenger-at w end)
    (passenger-at g end)
    (passenger-at c end)
    ))



  )

; plan
1. (enter-boat-with-goat farmer w g c b start start start)
   deleted: (passenger-at farmer start) (passenger-at g start)
   added: (passenger-at farmer b) (passenger-at g b)
   goals met: 0 of 3
2. (row-boat farmer b start end)
   deleted: (boat-at b start)
   added: (boat-at b end)
   goals met: 0 of 3
3. (leave-boat-with-thing farmer g b end)
   deleted: (passenger-at farmer b) (passenger-at g b)
   added: (passenger-at farmer end) (passenger-at g end)
   goals met: 1 of 3
4. (enter-boat farmer w g c b end start start end)
   deleted: (passenger-at farmer end)
   added: (passenger-at farmer b)
   goals met: 1 of 3
5. (row-boat farmer b end start)
   deleted: (boat-at b end)
   added: (boat-at b start)
   goals met: 1 of 3
6. (leave-empty-boat farmer w g c b start start start end)
   deleted: (passenger-at farmer b)
   added: (passenger-at farmer start)
   goals met: 1 of 3
7. (enter-boat-with-wolf farmer w g c b start start end)
   deleted: (passenger-at farmer start) (passenger-at w start)
   added: (passenger-at farmer b) (passenger-at w b)
   goals met: 1 of 3
8. (row-boat farmer b start end)
   deleted: (boat-at b start)
   added: (boat-at b end)
   goals met: 1 of 3
9. (leave-boat-with-thing farmer w b end)
   deleted: (passenger-at farmer b) (passenger-at w b)
   added: (passenger-at farmer end) (passenger-at w end)
   goals met: 2 of 3
10. (enter-boat-with-goat farmer w g c b end start end)
   deleted: (passenger-at farmer end) (passenger-at g end)
   added: (passenger-at farmer b) (passenger-at g b)
   goals met: 1 of 3
11. (row-boat farmer b end start)
   deleted: (boat-at b end)
   added: (boat-at b start)
   goals met: 1 of 3
12. (leave-boat-with-thing farmer g b start)
   deleted: (passenger-at farmer b) (passenger-at g b)
   added: (passenger-at farmer start) (passenger-at g start)
   goals met: 1 of 3
13. (enter-boat-with-cabbage farmer w g c b end start start)
   deleted: (passenger-at farmer start) (passenger-at c start)
   added: (passenger-at farmer b) (passenger-at c b)
   goals met: 1 of 3
14. (row-boat farmer b start end)
   deleted: (boat-at b start)
   added: (boat-at b end)
   goals met: 1 of 3
15. (leave-boat-with-thing farmer c b end)
   deleted: (passenger-at farmer b) (passenger-at c b)
   added: (passenger-at farmer end) (passenger-at c end)
   goals met: 2 of 3
16. (enter-boat farmer w g c b end end end start)
   deleted: (passenger-at farmer end)
   added: (passenger-at farmer b)
   goals met: 2 of 3
17. (row-boat farmer b end start)
   deleted: (boat-at b end)
   added: (boat-at b start)
   goals met: 2 of 3
18. (leave-empty-boat farmer w g c b start end end start)
   deleted: (passenger-at farmer b)
   added: (passenger-at farmer start)
   goals met: 2 of 3
19. (enter-boat-with-goat farmer w g c b end end start)
   deleted: (passenger-at farmer start) (passenger-at g start)
   added: (passenger-at farmer b) (passenger-at g b)
   goals met: 2 of 3
20. (row-boat farmer b start end)
   deleted: (boat-at b start)
   added: (boat-at b end)
   goals met: 2 of 3
21. (leave-boat-with-thing farmer g b end)
   deleted: (passenger-at farmer b) (passenger-at g b)
   added: (passenger-at farmer end) (passenger-at g end)
   goals met: 3 of 3
